import math


def area(r):
    '''
    Возвращает площадь круга с радиусом r.

        Параметры:
            r (int): радиус круга в виде целого числа
        
        Возвращаемое значение:
            area_multiply (float): произведение числа Пи и квадрата радиуса (площадь круга)

        Примеры вызова:
            >>> area(5)
            78.53981633974483
            >>> area(3)
            28.274333882308138

    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Возвращает периметр круга с радиусом r.

        Параметры:
            r (int): радиус круга в виде целого числа
        
        Возвращаемое значение:
            perimeter_multiply (float): удвоенное произведение числа Пи и радиуса (периметр круга)

        Примеры вызова:
            >>> perimeter(3)
            18.84955592153876
            >>> perimeter(7)
            43.982297150257104
    '''
    return 2 * math.pi * r

