def area(a, b): 
    '''
    Возвращает площадь прямоугольника со сторонами a и b.

        Параметры:
            a (int): первая сторона прямоугольника в виде целого числа
            b (int): вторая сторона прямоугольника в виде целого числа
        
        Возвращаемое значение:
            area_multiply (int): произведение сторон (площадь прямоугольника)

        Примеры вызова:
            >>> area(2, 5)
            10
            >>> area(3, 5)
            15
    '''
    return a * b 

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника со сторонами a и b.

        Параметры:
            a (int): первая сторона прямоугольника в виде целого числа
            b (int): вторая сторона прямоугольника в виде целого числа
        
        Возвращаемое значение:
            perimeter_sum (int): сумма удвоенных сторон (периметр прямоугольника)
    
        Примеры вызова:
            >>> perimeter(1, 5)
            12
            >>> perimeter(2, 3)
            10
    '''
    return (a * 2) + (b * 2) 