def area(a):
    '''
    Возвращает площадь квадрата со стороной a.

        Параметры:
            a (int): сторона квадрата в виде целого числа
        
        Возвращаемое значение:
            area_square (int): квадрат стороны (площадь квадрата)

        Примеры вызова:
            >>> area(5)
            25
            >>> area(7)
            49
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a.
        
        Параметры:
            a (int): сторона квадрата в виде целого числа
        
        Возвращаемое значение:
            perimeter_multiply (int): учетверенная длина стороны (периметр квадрата)

        Примеры вызова:
            >>> perimeter(3)
            12
            >>> perimeter(5)
            20
    '''
    return 4 * a
