def area(a, h): 
    '''
    Возвращает площадь треугольника, выраженная через сторону a и проведенной к ней высоте h.

        Параметры:
            a (int): сторона треугольника в виде целого числа
            h (int): высота треугольника в виде целого числа, проведенная к стороне треугольника
        
        Возвращаемое значение:
            area_multiply (float): произведение стороны и проведенной к ней высоты, деленная пополам (площадь треугольника)

        Примеры вызова:
            >>> area(7, 8)
            28.0
            >>> area(10, 4)
            20.0
            
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Возвращает периметр треугольника со сторонами a, b и c

        Параметры:
            a (int): первая сторона треугольника в виде целого числа
            b (int): вторая сторона треугольника в виде целого числа
            c (int): третья сторона треугольника в виде целого числа
        
        Возвращаемое значение:
            perimeter_sum (int): сумма трех сторон треугольника (периметр треугольника)
    
        Примеры вызова:
            >>> perimeter(3, 4, 5)
            12
            >>> perimeter(3, 7, 8)
            18
    '''
    return a + b + c 